Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.NoRoofsRoomBoundingWarn Property
 The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are room bounding, and make sure that the room offsets are high enough to include the roofs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRoofsRoomBoundingWarn { get; }
Public Shared ReadOnly Property NoRoofsRoomBoundingWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRoofsRoomBoundingWarn {
	FailureDefinitionId^ get ();
}
static member NoRoofsRoomBoundingWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace